#### Day 10: Subqueries in SQL üéâ

Welcome to Day 10! Today, we‚Äôll dive into **subqueries** ‚Äî a powerful way to nest one query within another. Subqueries are essential for writing advanced and efficient SQL queries.

#### 1. Database Connection

In [1]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to '30_Days_SQL'!

---
#### 1. Subquery in the WHERE Clause üåé
Find employees who earn more than the average salary.

In [2]:
query = """
SELECT name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_12316\3497941339.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

        name   salary
0      Brian  80000.0
1  Catherine  90000.0
2      Helen  95000.0

#### 2. Subquery in the SELECT Clause ‚öñÔ∏è
Find each employee‚Äôs salary and the average salary of their department.

In [3]:
query = """
SELECT name, salary,
       (SELECT AVG(salary)
        FROM employees e2
        WHERE e1.department_id = e2.department_id) AS avg_department_salary
FROM employees e1;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_12316\1709678488.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

        name   salary  avg_department_salary
0       Alan  60000.0                55000.0
1      Brian  80000.0                87500.0
2  Catherine  90000.0                90000.0
3      Dylan  50000.0                55000.0
4       Evan  70000.0                70000.0
5      Helen  95000.0                87500.0

#### 3. Subquery in the FROM Clause üåÑ
Find the department total salaries (using IT as an example label).

In [4]:
query = """
SELECT department_id, total_salary
FROM (SELECT department_id, SUM(salary) AS total_salary
      FROM employees
      GROUP BY department_id) AS department_totals
WHERE total_salary = (SELECT MAX(total_salary)
                      FROM (SELECT department_id, SUM(salary) AS total_salary
                            FROM employees
                            GROUP BY department_id) AS department_totals);
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_12316\2772159050.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   department_id  total_salary
0              3      175000.0

In [5]:
conn.close()